# Basic Level

# (Focus: Familiarity with Series, DataFrames, Selection)

1. Create a Series of student marks and assign custom index labels as student names.
   → Then display only students who scored above 80.

2. Create a DataFrame with columns Name, Age, and City.
   → Change column names to uppercase using Pandas.

3. Read a CSV file named "students.csv" and show:

     First 3 rows

     Column names

     Number of rows and columns.

4. Create a DataFrame from a Python dictionary and access:

     The second row using .iloc[]

     The Age column using .loc[].

5. Create a new column AgeGroup:

     If Age ≥ 18 → “Adult”

     Else → “Minor”.

In [1]:
import pandas as pd
import numpy as np

In [2]:
student_marks = np.random.randint(42, 101, size=12) 
student_name = ["Larry","Page","Paper","Tony","Captain","Antonio","Smith","Ant","Spider","Hwak","Rohit","Mohit"]

df = pd.DataFrame({
    "Student Name": student_name,
    "Student Marks": student_marks
})
print(df)

   Student Name  Student Marks
0         Larry             75
1          Page             78
2         Paper             94
3          Tony             89
4       Captain             78
5       Antonio             68
6         Smith             67
7           Ant             46
8        Spider             80
9          Hwak             65
10        Rohit             96
11        Mohit             54

In [3]:
mask=df['Student Marks']>80
print(df.loc[mask,['Student Name','Student Marks']])

   Student Name  Student Marks
2         Paper             94
3          Tony             89
10        Rohit             96

In [4]:
data={
    "Name":[],
    "Age":[],
    "City":[]
}
df1=pd.DataFrame(data)
print(df1)

Empty DataFrame
Columns: [Name, Age, City]
Index: []

In [5]:
df1.columns.str.upper()

Index(['NAME', 'AGE', 'CITY'], dtype='object')

In [6]:
df2=pd.read_csv("students.csv")
df2.head(3)

      Name   Age    City  Score
0    Alice  20.0   Delhi     85
1      Bob  22.0  Mumbai     90
2  Charlie  19.0   Delhi     78

In [7]:
print(df2.columns)

Index(['Name', 'Age', 'City', 'Score'], dtype='object')

In [8]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   Age     7 non-null      float64
 2   City    7 non-null      object
 3   Score   8 non-null      int64
dtypes: float64(1), int64(1), object(2)
memory usage: 388.0+ bytes

In [9]:
data1={
    "Name":["Urbesh","Shayak","Rupam","Raha","Haka","Jeet","Venom"],
    "Age":[21,21,23,25,27,29,25],
    "City":["Haldia","Haldia","Howrah","Hindmotor","Sapurchi","Somewhere","Kona"]
}
df3=pd.DataFrame(data1)
print(df3)

     Name  Age       City
0  Urbesh   21     Haldia
1  Shayak   21     Haldia
2   Rupam   23     Howrah
3    Raha   25  Hindmotor
4    Haka   27   Sapurchi
5    Jeet   29  Somewhere
6   Venom   25       Kona

In [10]:
df3.iloc[1:2,0:3]

     Name  Age    City
1  Shayak   21  Haldia

In [11]:
df3.loc[0:7,["Age"]]

   Age
0   21
1   21
2   23
3   25
4   27
5   29
6   25

In [12]:
df3["AgeGroup"]=np.where(df3["Age"]>=18,'Yes','No')
df3.head()

     Name  Age       City AgeGroup
0  Urbesh   21     Haldia      Yes
1  Shayak   21     Haldia      Yes
2   Rupam   23     Howrah      Yes
3    Raha   25  Hindmotor      Yes
4    Haka   27   Sapurchi      Yes